'''
此项目包含 Python输入函数input(),运算符,运算符优先级等知识
'''
a=input('来辣！\n')      # 提醒输入内容。为字符串类型
print(a)
print(str(11/5),str(11//5))     # 双斜杠表示整除
print(-9//4)        # 结果为-3，一正一负向下取整（-2.25）
print(9%-4)          # 结果为-3，余数=被除数-除数*商  9-(-4)*(-3)
print(3**3)         # 结果为27，幂运算
a=b=c=20
print(id(a),id(b),id(c))  # id()取地址
a=1
b=2
a,b=b,a     # 交换变量值
print("交换后",a,b)
d,e,f=1,2,3
print(d,e,f)   # 等号两边数目对等
a=10
b=10
print(a is b)   # 结果为true，is判断前后地址是否相同   is not比较地址是否不相等
print(a==b)     # 比较的是值
# and/or/not 对应&&/||/!
s='jhaihbufo'
print('j' in s)  # true 判断是否包含/对应not in
a=4
b=8
print(a&b)      # *计算机先转化为二进制！*按位与00000100  00001000 同时为一，结果为1。此结果是0----''|''按位或--<<左移一位-->>右移一位
'''
无括号优先级
算数运算： 幂，乘除（取余），加减||
位运算 >>,<<,&,|
比较运算  >,<,!=.........结果为true或者false
布尔运算 and,or
赋值运算
'''

